{
  "summary": "I hold a Bachelor's Degree in Mechanical Engineering.\n\nAfter college, I worked at Rocky Mountain Engineering and Materials Technology (REMTEC) from 2018 to 2020. There, I collaborated with a licensed PE, engaging in material evaluation, failure analysis, accident investigation, finite element analysis, and metallurgical engineering.\n\nFollowing my experience at RMEMTEC, I joined Dish Network as a Hardware Engineer from 2020 to 2022. During this period, I designed various test enclosures for circuit boards and LNBFs, and I gained expertise in Product Lifecycle Management. It was during my tenure at Dish Network that I realized my passion for transitioning from hardware to software.\n\nIn August 2022, I made a significant career change from Mechanical Engineering to Software Development. I embarked on a transformative journey by enrolling in the Back End Engineering program at Turing School of Software and Design, where I earned a certificate.\n\nSubsequently, I secured a highly competitive Back End Engineer Intern position at my current company, Bitly.\n\nWithin the first few weeks of joining, I was able to make an impactful contribution developing the backend for the successful release of the Monthly API and Consumable Feature Launch.\n\nBuilding on this success, I had the privilege of leading my own project, overseeing the complete backend development for a substantial user export feature tailored for our Enterprise organizations. This involved collaborative efforts from the initial customer success interactions to ticket creation and the final construction of the backend. The feature, which required adapting and enhancing functionality across various services, is set to be integrated into the UI later this year.\n\nAfter my work was finished with the Organization User Export feature, I then jumped in and started racking up tickets for a new project which will allow an Enterprise Organization to claim an email domain. This included me migrating database reliance from the client-side functionality in one service to an entirely different database in another service. This was a large effort and required rebuilding much of the current functionality to have everything back to working as original.\n\nSince the expiration of my contract at Bitly, I have spent a significant amount of time building up my platform/devops skills implementing tools such as Docker, Kubernetes, AWS, and Terraform."
}
